NextFOAM-2501/tutorials/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Setup case
./Allrun.pre

#-- Run on single processor

# Agglomerate patch faces
#for region in bottomAir topAir
#do
#    runApplication -s "$region" \
#        faceAgglomerate -region "$region" -dict constant/viewFactorsDict
#done

# Generate view factors
for region in bottomAir topAir
do
    runApplication -s "$region" \
        viewFactorsGen -region "$region"
done

runApplication $(getApplication)

runApplication foamToEnsight -allRegions

#------------------------------------------------------------------------------
